package com.kedang.fenxiao.util;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by gegongxian on 17/3/31.
 */
public class ProvinceAreaMapUtils
{

	public static Map<String, Map<String, String>> provinceMap = new HashMap<String, Map<String, String>>();

	public static Map<String, String> ProvinceAreaMap(String provinceId)
	{
		if (null == provinceMap || provinceMap.size() == 0)
		{
			setProvinceMap();
		}
		return provinceMap.get(provinceId);
	}

	public static void setProvinceMap()
	{
		Map<String, String> _010 = new HashMap<String, String>();
		_010.put("010", "北京");
		provinceMap.put("010", _010);

		Map<String, String> _020 = new HashMap<String, String>();
		_020.put("0660", "汕尾");
		_020.put("0662", "阳江");
		_020.put("0663", "揭阳");
		_020.put("0668", "茂名");
		_020.put("0750", "江门");
		_020.put("0751", "韶关");
		_020.put("0752", "惠州");
		_020.put("0753", "梅州");
		_020.put("0754", "汕头");
		_020.put("0755", "深圳");
		_020.put("0756", "珠海");
		_020.put("0757", "佛山");
		_020.put("0758", "肇庆");
		_020.put("0759", "湛江");
		_020.put("0760", "中山");
		_020.put("0762", "河源");
		_020.put("0763", "清远");
		_020.put("0766", "云浮");
		_020.put("0768", "潮州");
		_020.put("0769", "东莞");
		_020.put("020", "广州");
		provinceMap.put("020", _020);

		Map<String, String> _021 = new HashMap<String, String>();
		_021.put("021", "上海");
		provinceMap.put("021", _021);

		Map<String, String> _022 = new HashMap<String, String>();
		_022.put("022", "天津");
		provinceMap.put("022", _022);

		Map<String, String> _023 = new HashMap<String, String>();
		_023.put("023", "重庆");
		provinceMap.put("023", _023);

		Map<String, String> _025 = new HashMap<String, String>();
		_025.put("0510", "无锡");
		_025.put("0511", "镇江");
		_025.put("0512", "苏州");
		_025.put("0513", "南通");
		_025.put("0514", "扬州");
		_025.put("0515", "盐城");
		_025.put("0516", "徐州");
		_025.put("0517", "淮安");
		_025.put("0518", "连云港");
		_025.put("0519", "常州");
		_025.put("0523", "泰州");
		_025.put("0527", "宿迁");
		_025.put("025", "南京");
		provinceMap.put("025", _025);

		Map<String, String> _026 = new HashMap<String, String>();
		_026.put("0970", "海北");
		_026.put("0971", "西宁");
		_026.put("0972", "海东");
		_026.put("0973", "黄南");
		_026.put("0974", "共和");
		_026.put("0975", "果洛");
		_026.put("0976", "玉树");
		_026.put("0977", "德令哈");
		_026.put("0979", "格尔木");
		provinceMap.put("026", _026);

		Map<String, String> _027 = new HashMap<String, String>();
		_027.put("0898", "海口");
		_027.put("0899", "三亚");
		provinceMap.put("027", _027);

		Map<String, String> _028 = new HashMap<String, String>();
		_028.put("0812", "攀枝花");
		_028.put("0813", "自贡");
		_028.put("0816", "绵阳");
		_028.put("0817", "南充");
		_028.put("0818", "达州");
		_028.put("0825", "遂宁");
		_028.put("0826", "广安");
		_028.put("0827", "巴中");
		_028.put("0830", "泸州");
		_028.put("0831", "宜宾");
		_028.put("0832", "内江");
		_028.put("0833", "乐山");
		_028.put("0834", "西昌");
		_028.put("0835", "雅安");
		_028.put("0836", "甘孜");
		_028.put("0837", "阿坝");
		_028.put("0838", "德阳");
		_028.put("0839", "广元");
		_028.put("028", "眉山");
		provinceMap.put("028", _028);

		Map<String, String> _029 = new HashMap<String, String>();
		_029.put("0910", "咸阳");
		_029.put("0911", "延安");
		_029.put("0912", "榆林");
		_029.put("0913", "渭南");
		_029.put("0914", "商洛");
		_029.put("0915", "安康");
		_029.put("0916", "汉中");
		_029.put("0917", "宝鸡");
		_029.put("0919", "铜川");
		_029.put("029", "西安");
		provinceMap.put("029", _029);

		Map<String, String> _030 = new HashMap<String, String>();
		_030.put("0349", "朔州");
		_030.put("0350", "忻州");
		_030.put("0351", "太原");
		_030.put("0352", "大同");
		_030.put("0353", "阳泉");
		_030.put("0354", "晋中");
		_030.put("0355", "长治");
		_030.put("0356", "晋城");
		_030.put("0357", "临汾");
		_030.put("0358", "吕梁");
		_030.put("0359", "运城");
		provinceMap.put("030", _030);

		Map<String, String> _035 = new HashMap<String, String>();
		_035.put("0310", "邯郸");
		_035.put("0311", "石家庄");
		_035.put("0312", "保定");
		_035.put("0313", "张家口");
		_035.put("0314", "承德");
		_035.put("0315", "唐山");
		_035.put("0316", "廊坊");
		_035.put("0317", "沧州");
		_035.put("0318", "衡水");
		_035.put("0319", "邢台");
		_035.put("0335", "秦皇岛");
		provinceMap.put("035", _035);

		Map<String, String> _039 = new HashMap<String, String>();
		_039.put("0370", "商丘");
		_039.put("0371", "郑州");
		_039.put("0372", "安阳");
		_039.put("0373", "新乡");
		_039.put("0374", "许昌");
		_039.put("0375", "平顶山");
		_039.put("0376", "信阳");
		_039.put("0377", "南阳");
		_039.put("0378", "开封");
		_039.put("0379", "洛阳");
		_039.put("0391", "焦作");
		_039.put("0392", "鹤壁");
		_039.put("0393", "濮阳");
		_039.put("0394", "周口");
		_039.put("0395", "漯河");
		_039.put("0396", "驻马店");
		_039.put("0398", "三门峡");
		provinceMap.put("039", _039);

		Map<String, String> _040 = new HashMap<String, String>();
		_040.put("0470", "呼伦贝尔");
		_040.put("0471", "呼和浩特");
		_040.put("0472", "包头");
		_040.put("0473", "乌海");
		_040.put("0474", "乌兰察布");
		_040.put("0475", "通辽");
		_040.put("0476", "赤峰");
		_040.put("0477", "鄂尔多斯");
		_040.put("0478", "巴彦淖尔");
		_040.put("0479", "锡林郭勒盟");
		_040.put("0482", "兴安盟");
		_040.put("0483", "阿拉善盟");
		provinceMap.put("040", _040);

		Map<String, String> _041 = new HashMap<String, String>();
		_041.put("0410", "铁岭");
		_041.put("0411", "大连");
		_041.put("0412", "鞍山");
		_041.put("0413", "抚顺");
		_041.put("0414", "本溪");
		_041.put("0415", "丹东");
		_041.put("0416", "锦州");
		_041.put("0417", "营口");
		_041.put("0418", "阜新");
		_041.put("0419", "辽阳");
		_041.put("0421", "朝阳");
		_041.put("0427", "盘锦");
		_041.put("0429", "葫芦岛");
		_041.put("024", "沈阳");
		provinceMap.put("041", _041);

		Map<String, String> _045 = new HashMap<String, String>();
		_045.put("0431", "长春");
		_045.put("0432", "吉林");
		_045.put("0433", "延边");
		_045.put("0434", "四平");
		_045.put("0435", "通化");
		_045.put("0436", "白城");
		_045.put("0437", "辽源");
		_045.put("0438", "松原");
		_045.put("0439", "白山");
		provinceMap.put("045", _045);

		Map<String, String> _046 = new HashMap<String, String>();
		_046.put("0451", "哈尔滨");
		_046.put("0452", "齐齐哈尔");
		_046.put("0453", "牡丹江");
		_046.put("0454", "佳木斯");
		_046.put("0455", "绥化");
		_046.put("0456", "黑河");
		_046.put("0457", "大兴安岭");
		_046.put("0458", "伊春");
		_046.put("0459", "大庆");
		_046.put("0464", "七台河");
		_046.put("0467", "鸡西");
		_046.put("0468", "鹤岗");
		_046.put("0469", "双鸭山");
		provinceMap.put("046", _046);

		Map<String, String> _050 = new HashMap<String, String>();
		_050.put("0550", "滁州");
		_050.put("0551", "合肥");
		_050.put("0552", "蚌埠");
		_050.put("0553", "芜湖");
		_050.put("0554", "淮南");
		_050.put("0555", "马鞍山");
		_050.put("0556", "安庆");
		_050.put("0557", "宿州");
		_050.put("0558", "阜阳");
		_050.put("0559", "黄山");
		_050.put("0561", "淮北");
		_050.put("0562", "铜陵");
		_050.put("0563", "宣城");
		_050.put("0564", "六安");
		_050.put("0565", "巢湖");
		_050.put("0566", "池州");
		provinceMap.put("050", _050);

		Map<String, String> _055 = new HashMap<String, String>();
		_055.put("0570", "衢州");
		_055.put("0571", "杭州");
		_055.put("0572", "湖州");
		_055.put("0573", "嘉兴");
		_055.put("0574", "宁波");
		_055.put("0575", "绍兴");
		_055.put("0576", "台州");
		_055.put("0577", "温州");
		_055.put("0578", "丽水");
		_055.put("0579", "金华");
		_055.put("0580", "舟山");
		provinceMap.put("055", _055);

		Map<String, String> _059 = new HashMap<String, String>();
		_059.put("0591", "福州");
		_059.put("0592", "厦门");
		_059.put("0593", "宁德");
		_059.put("0594", "莆田");
		_059.put("0595", "泉州");
		_059.put("0596", "漳州");
		_059.put("0597", "龙岩");
		_059.put("0598", "三明");
		_059.put("0599", "南平");
		provinceMap.put("059", _059);

		Map<String, String> _060 = new HashMap<String, String>();
		_060.put("0530", "菏泽");
		_060.put("0531", "济南");
		_060.put("0532", "青岛");
		_060.put("0533", "淄博");
		_060.put("0534", "德州");
		_060.put("0535", "烟台");
		_060.put("0536", "潍坊");
		_060.put("0537", "济宁");
		_060.put("0538", "泰安");
		_060.put("0539", "临沂");
		_060.put("0543", "滨州");
		_060.put("0546", "东营");
		_060.put("0631", "威海");
		_060.put("0632", "枣庄");
		_060.put("0633", "日照");
		_060.put("0634", "莱芜");
		_060.put("0635", "聊城");
		provinceMap.put("060", _060);

		Map<String, String> _070 = new HashMap<String, String>();
		_070.put("0770", "防城港");
		_070.put("0771", "南宁");
		_070.put("0772", "柳州");
		_070.put("0773", "桂林");
		_070.put("0774", "梧州");
		_070.put("0775", "玉林");
		_070.put("0776", "百色");
		_070.put("0777", "钦州");
		_070.put("0778", "河池");
		_070.put("0779", "北海");
		provinceMap.put("070", _070);

		Map<String, String> _071 = new HashMap<String, String>();
		_071.put("0710", "襄阳");
		_071.put("0711", "鄂州");
		_071.put("0712", "孝感");
		_071.put("0713", "黄冈");
		_071.put("0714", "黄石");
		_071.put("0715", "咸宁");
		_071.put("0716", "荆州");
		_071.put("0717", "宜昌");
		_071.put("0718", "恩施");
		_071.put("0719", "十堰");
		_071.put("0722", "随州");
		_071.put("0724", "荆门");
		_071.put("0728", "仙桃");
		_071.put("027", "武汉");
		provinceMap.put("071", _071);

		Map<String, String> _073 = new HashMap<String, String>();
		_073.put("0730", "岳阳");
		_073.put("0731", "长沙");
		_073.put("0734", "衡阳");
		_073.put("0735", "郴州");
		_073.put("0736", "常德");
		_073.put("0737", "益阳");
		_073.put("0738", "娄底");
		_073.put("0739", "邵阳");
		_073.put("0743", "吉首");
		_073.put("0744", "张家界");
		_073.put("0745", "怀化");
		_073.put("0746", "永州");
		provinceMap.put("073", _073);

		Map<String, String> _075 = new HashMap<String, String>();
		_075.put("0790", "新余");
		_075.put("0791", "南昌");
		_075.put("0792", "九江");
		_075.put("0793", "上饶");
		_075.put("0794", "抚州");
		_075.put("0795", "宜春");
		_075.put("0796", "吉安");
		_075.put("0797", "赣州");
		_075.put("0798", "景德镇");
		_075.put("0799", "萍乡");
		_075.put("0701", "鹰潭");
		provinceMap.put("075", _075);

		Map<String, String> _080 = new HashMap<String, String>();
		_080.put("0870", "昭通");
		_080.put("0871", "昆明");
		_080.put("0872", "大理");
		_080.put("0873", "红河");
		_080.put("0874", "曲靖");
		_080.put("0875", "保山");
		_080.put("0876", "文山");
		_080.put("0877", "玉溪");
		_080.put("0878", "楚雄");
		_080.put("0879", "普洱");
		_080.put("0883", "临沧");
		_080.put("0886", "怒江");
		_080.put("0887", "迪庆");
		_080.put("0888", "丽江");
		_080.put("0691", "西双版纳");
		_080.put("0692", "德宏");
		provinceMap.put("080", _080);

		Map<String, String> _085 = new HashMap<String, String>();
		_085.put("0851", "贵阳");
		_085.put("0852", "遵义");
		_085.put("0853", "安顺");
		_085.put("0854", "黔南");
		_085.put("0855", "黔东南");
		_085.put("0856", "铜仁");
		_085.put("0857", "毕节");
		_085.put("0858", "六盘水");
		_085.put("0859", "黔西南");
		provinceMap.put("085", _085);

		Map<String, String> _089 = new HashMap<String, String>();
		_089.put("0891", "拉萨");
		_089.put("0892", "日喀则");
		_089.put("0893", "山南");
		_089.put("0894", "林芝");
		_089.put("0895", "昌都");
		_089.put("0896", "那曲");
		_089.put("0897", "阿里");
		provinceMap.put("089", _089);

		Map<String, String> _090 = new HashMap<String, String>();
		_090.put("0951", "银川");
		_090.put("0952", "石嘴山");
		_090.put("0953", "吴忠");
		_090.put("0954", "固原");
		_090.put("0955", "中卫");
		provinceMap.put("090", _090);

		Map<String, String> _093 = new HashMap<String, String>();
		_093.put("0930", "临夏");
		_093.put("0931", "兰州");
		_093.put("0932", "定西");
		_093.put("0933", "平凉");
		_093.put("0934", "庆阳");
		_093.put("0935", "武威");
		_093.put("0936", "张掖");
		_093.put("0937", "嘉峪关");
		_093.put("0938", "天水");
		_093.put("0939", "陇南");
		_093.put("0941", "甘南");
		_093.put("0943", "白银");
		provinceMap.put("093", _093);

		Map<String, String> _095 = new HashMap<String, String>();
		_095.put("0901", "塔城");
		_095.put("0902", "哈密");
		_095.put("0903", "和田");
		_095.put("0906", "阿勒泰");
		_095.put("0908", "克州");
		_095.put("0909", "博乐");
		_095.put("0990", "克拉玛依");
		_095.put("0991", "乌鲁木齐");
		_095.put("0992", "奎屯");
		_095.put("0993", "石河子");
		_095.put("0994", "昌吉");
		_095.put("0995", "吐鲁番");
		_095.put("0996", "库尔勒");
		_095.put("0997", "阿克苏");
		_095.put("0998", "喀什");
		_095.put("0999", "伊犁");
		provinceMap.put("095", _095);
	}
}
